
'''
Создать калькулятор для работы с рациональными и комплексными числами, организовать меню, 
   добавив в неё систему логирования.

В рамках этого обсуждения студентам надо нарисовать “архитектуру” 
     (например, в виде блок-схемы) для работы данного приложения.
'''

import pol_number
import control
print(control.proverka(*pol_number.importdata()))









  


  
    